RoanBrand/espix/sdkconfig.defaults.esp32s31
# espix — ESP32-S31 with in-package PSRAM (WROOM-3: 16 MB flash, 8/16 MB PSRAM).
#
# The PSRAM is always octal and always 250 MHz (there is no mode or speed to
# choose), and IDF detects its size at runtime, so there is no compile-time
# difference between the PSRAM variants -- which is why the board identity is
# plain `s31`, with no PSRAM suffix. The image is built for the WROOM-3's 16 MB
# flash; the loader provisions the partition table for whatever flash it finds,
# from the 8, 16 and 32 MB tables it carries.

CONFIG_IDF_TARGET="esp32s31"

#
# Flash
#
# The WROOM-3 is a 16 MB part, and IDF puts the flash size in the image header and
# refuses to probe a chip larger than it. The image is still flashed with the
# smallest table (8 MB), which is valid on any larger chip; the loader writes the
# table that matches the physical flash. See docs/OTA.md 11.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/esp32s31-8mb.csv"
# DIO, IDF's own default for this target (the S3 uses QIO).
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

#
# PSRAM — apps are loaded here, so it is not optional on this target.
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# XIP-from-PSRAM is inherited from the target-independent defaults (it is what
# closes the flash-cache crash documented there).
# Load relocated ELF text/data into PSRAM (this is the elf_loader, not XIP).
# There is no bus-address mirror to rely on as on the S3; the component
# handles the target itself.
#
CONFIG_ELF_LOADER_LOAD_PSRAM=y

#
# CPU
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_320=y

#
# Networking: the S31 has a Gigabit Ethernet MAC. The option lives in
# components/espix_net/Kconfig and is on by default wherever SOC_EMAC_SUPPORTED.
#
CONFIG_ESPIX_ETH_ENABLED=y

#
# Bluetooth -- the S31 has Classic as well as BLE, which the S3 does not, so
# A2DP/HFP live here. Bluedroid is the host that supports Classic.
#
CONFIG_ESPIX_BT=y

# NB: CONFIG_ESP_SYSTEM_USE_FRAME_POINTER would make watchdog dumps readable,
# but it adds ~152 KB of code -- enough to overflow the 3.5 MB kernel slot. Not
# on this part; the coredump backtrace is the tool for real faults.

# Audio playback (play). Resampling is OFF -- not because the part cannot
# do it. The S31 has a hardware ASRC (CONFIG_SOC_ASRC_SUPPORTED; esp_asrc, and
# GMF's aud_asrc element with perf_type AUTO). What cannot keep up is *this
# path*: esp_audio_simple_player hardcodes the software converter (aud_rate_cvt
# -> esp_audio_effects), which against a 48 kHz source loses ~250 short reads/s
# (~110 kB/s) and starves the PCM ring -- where the same pipeline without it
# has zero short reads.
#
# So the source must match the sink's negotiated rate; SBC sinks pick 44.1 kHz
# in practice (the soundcore Q45 does), which is what a CD-rate MP3 already is.
# The fix is to route resampling through the hardware ASRC -- a player/pipeline
# change -- not to accept a limit the silicon does not have.
# play's pipeline is espix's own (components/espix_audio), so the elements it
# needs come from gmf_loader: the file/http readers, the decoder, and the
# HARDWARE ASRC. The simple player's software converter is not on this path.
CONFIG_GMF_IO_INIT_FILE_READER=y
CONFIG_GMF_IO_INIT_HTTP_READER=y
# Only the MP3 decoder. The codecs are one prebuilt per-chip archive, and
# registering all of them is what pushed the kernel past its 3.5 MB partition;
# the choice below selects the one the loader's aud_dec is built around.
CONFIG_GMF_AUDIO_CODEC_INIT_DECODER=y
CONFIG_AUDIO_DECODER_MP3_SUPPORT=y
# CONFIG_AUDIO_DECODER_AAC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_G711_SUPPORT is not set
# CONFIG_AUDIO_DECODER_AMRNB_SUPPORT is not set
# CONFIG_AUDIO_DECODER_AMRWB_SUPPORT is not set
# CONFIG_AUDIO_DECODER_FLAC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_OPUS_SUPPORT is not set
# CONFIG_AUDIO_DECODER_VORBIS_SUPPORT is not set
# CONFIG_AUDIO_DECODER_ADPCM_SUPPORT is not set
# CONFIG_AUDIO_DECODER_ALAC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_PCM_SUPPORT is not set
# CONFIG_AUDIO_DECODER_SBC_SUPPORT is not set
# CONFIG_AUDIO_DECODER_LC3_SUPPORT is not set
# CONFIG_AUDIO_DECODER_G722_SUPPORT is not set
CONFIG_GMF_AUDIO_CODEC_DECODER_TYPE_MP3=y
CONFIG_GMF_AUDIO_EFFECT_INIT_ASRC=y
CONFIG_GMF_AUDIO_EFFECT_ASRC_DEST_RATE=44100
CONFIG_GMF_AUDIO_EFFECT_ASRC_PERF_TYPE_AUTO=y

# The simple player is no longer play's engine, but stays a dependency until
# its config surface is removed too.
# CONFIG_ESP_AUDIO_SIMPLE_PLAYER_RESAMPLE_EN is not set
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=n
# Classic only: the controller must be in BR/EDR mode for A2DP (IDF's own
# a2dp_source example sets these three for exactly this reason).
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=n
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_MODE_BTDM=n


# littlefs I/O units were tried here (read_size 128->512, cache_size 512->4096,
# lookahead 128->1024) and measured: about 10% faster (read per second of audio
# ~1150-1330 ms down to ~1076-1245) for 4 kB of internal RAM gone (30 kB free
# -> 13 kB). Not worth it while internal is the scarce pool, and not the real
# limit either -- the USB path is just as slow, at the same ~180 kB/s.
# See docs/ROADMAP.md.

#
# Console
#
# The primary console is UART0 on the external chip, which is what this board is
# wired for. IDF also mirrors output to the USB-Serial/JTAG secondary by
# default, and on a board with a real UART that is redundant and not free:
# every log line is written twice, and the USB-Serial/JTAG write spins when the
# host is not draining it -- exactly the case while OpenOCD holds the port.
# Off, so the USB-DBG port carries JTAG and nothing else.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

#
# Audio codec
#
# Two library variants exist for S31 -- lib/esp32s31 (assembly) and
# lib/esp32s31_esp_c (portable C) -- selected by ESP_AUDIO_CODEC_S31_USE_ASM,
# which 2.6.2 defaults to n. Keep the default. Disassembling both shows the
# assembly variant uses the PIE coprocessor only in LC3 (114 sites) and Opus
# (19), and not in MP3 at all; and on S31 only core 1 has PIE, so FreeRTOS pins
# the calling task to core 1 on its first PIE instruction (IDF's own
# freertos/test_apps/freertos/port/test_pie_in_task.c says so). No MP3 gain,
# and a core-affinity constraint not worth taking on yet. Revisit for LE Audio.
# CONFIG_ESP_AUDIO_CODEC_S31_USE_ASM is not set
